GameCard = ([4, 4, 1, 4], #Створюю ігрову карту у вигляді матриці, де № рядка (i) - номер ходу, номер елемента в рядку (j) - варіанти куди зайде  Шарік (1 - оптимальний, 2 - стіна, 3 - вернеться назад, 4 - не оптимальний, 5 - фініш) 
            [3, 2, 1, 2],
            [3, 2, 2, 1],
            [1, 3, 2, 2],
            [2, 2, 3, 1],
            [2, 3, 1, 2],
            [3, 2, 1, 4],
            [3, 2, 1, 2],
            [3, 4, 1, 2],
            [3, 4, 2, 1],
            [4, 3, 2, 1],
            [2, 3, 1, 2],
            [3, 2, 1, 4],
            [3, 2, 1, 2],
            [3, 2, 1, 2],
            [3, 2, 2, 1],
            [1, 3, 2, 2],
            [2, 2, 3, 1],
            [2, 3, 4, 1],
            [1, 3, 2, 2],
            [2, 2, 3, 1],
            [4, 3, 1, 2],
            [3, 2, 2, 1],
            [2, 3, 1, 2],
            [3, 2, 5, 2])
for i in range(len(GameCard)):
    j = int(input('Введіть напрям руху Шаріка 0 - вліво, 1 - вверх, 2 - вправо, 3 - вниз'))
    if (j < 0) or (j > 3):
        print('Введено некоректно напрям рухуб гра закінчена')
        break
    else:
        if GameCard[i][j] == 1:
            print ('Шарік знайшов правильний шлях')
        if GameCard[i][j] == 2:
            print ('Шарік вдарився в стіну, гра закінчена')
            break
        if GameCard[i][j] == 3:
            print ('Шарік злякався і втік, гра закінчена')
            break
        if GameCard[i][j] == 4:
            print ('Шарік заблудився, гра закінчена')
            break
        if GameCard[i][j] == 5:
            print ('Вітаємо!!! Шарік знайшов ввихід!!! Гра закінчена!!!')
           
    
